modules/documentation/src/site/resources/samples/msgs/req02.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xenc="http://www.w3.org/2001/04/xmlenc#">
   <soapenv:Header xmlns:wsa="http://www.w3.org/2005/08/addressing">
      <wsse:Security xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd" soapenv:mustUnderstand="1">
         <wsu:Timestamp xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd" wsu:Id="Timestamp-671035">
            <wsu:Created>2008-06-23T13:10:54.892Z</wsu:Created>
            <wsu:Expires>2008-06-23T13:15:54.892Z</wsu:Expires>
         </wsu:Timestamp>
         <xenc:EncryptedKey Id="EncKeyId-urn:uuid:4BB2B4A78829897FA412142266555822">
            <xenc:EncryptionMethod Algorithm="http://www.w3.org/2001/04/xmlenc#rsa-oaep-mgf1p" />
            <ds:KeyInfo xmlns:ds="http://www.w3.org/2000/09/xmldsig#">
               <wsse:SecurityTokenReference>
                  <wsse:KeyIdentifier EncodingType="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-soap-message-security-1.0#Base64Binary" ValueType="http://docs.oasis-open.org/wss/oasis-wss-soap-message-security-1.1#ThumbprintSHA1">HYL371NzoOs2+IA24VDkBGcUFQM=</wsse:KeyIdentifier>
               </wsse:SecurityTokenReference>
            </ds:KeyInfo>
            <xenc:CipherData>
               <xenc:CipherValue>DPqhh74Sed1b4ftUFuxdJDN+EqacoDLWwLuhioh+JBdJdeUrMcBT35CVENhQLjdmn1KupGz7AOA5MnKZTxTz9db4vvb0NWSENw6LYRMbMoosSOEhIA661kl7Nh2DSu1zUCj1uaBEUcSLanoLXV2ukBl5xpOztsjnxtv+PBDATuk=</xenc:CipherValue>
            </xenc:CipherData>
         </xenc:EncryptedKey>
         <ds:Signature xmlns:ds="http://www.w3.org/2000/09/xmldsig#" Id="Signature-24833256">
            <ds:SignedInfo>
               <ds:CanonicalizationMethod Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#" />
               <ds:SignatureMethod Algorithm="http://www.w3.org/2000/09/xmldsig#hmac-sha1" />
               <ds:Reference URI="#Id-17427094">
                  <ds:Transforms>
                     <ds:Transform Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#" />
                  </ds:Transforms>
                  <ds:DigestMethod Algorithm="http://www.w3.org/2000/09/xmldsig#sha1" />
                  <ds:DigestValue>ER13nSQoU0r4ClwmIomrNeFT/GM=</ds:DigestValue>
               </ds:Reference>
               <ds:Reference URI="#Timestamp-671035">
                  <ds:Transforms>
                     <ds:Transform Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#" />
                  </ds:Transforms>
                  <ds:DigestMethod Algorithm="http://www.w3.org/2000/09/xmldsig#sha1" />
                  <ds:DigestValue>0c73jMRXfdIP8g12FVgtXWZEJVs=</ds:DigestValue>
               </ds:Reference>
            </ds:SignedInfo>
            <ds:SignatureValue>lnQpzG7gC0ScRaVLZZeZac/dbDA=</ds:SignatureValue>
            <ds:KeyInfo Id="KeyId-5313146">
               <wsse:SecurityTokenReference xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd" wsu:Id="STRId-9708927">
                  <wsse:Reference URI="#EncKeyId-urn:uuid:4BB2B4A78829897FA412142266555822" ValueType="http://docs.oasis-open.org/wss/oasis-wss-saml-token-profile-1.0#EncryptedKey" />
               </wsse:SecurityTokenReference>
            </ds:KeyInfo>
         </ds:Signature>
      </wsse:Security>
      <wsa:To>http://localhost:8081/axis2/services/sample02</wsa:To>
      <wsa:MessageID>urn:uuid:62D436CDF33F6A15561214226653256</wsa:MessageID>
      <wsa:Action>urn:echo</wsa:Action>
   </soapenv:Header>
   <soapenv:Body xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd" wsu:Id="Id-17427094">
      <ns1:echo xmlns:ns1="http://sample02.policy.samples.rampart.apache.org">
         <param0>Hello world</param0>
      </ns1:echo>
   </soapenv:Body>
</soapenv:Envelope>